Tekla Open API Reference for Tekla Structures 2025
SymbolInfo.SymbolIndex Property
 Gets or sets the the symbol index. Throws an ArgumentOutOfRangeException if the symbol index is not in the range from 0 to 255.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int SymbolIndex { get; set; }
Public Property SymbolIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SymbolInfo Class
Tekla.Structures.Drawing Namespace